zephyrproject-rtos/zephyr/drivers/rtc/rtc_hal_stm32u5.c
/*
 * Copyright (c) 2021 LACROIX Group
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * RTC driver for stm32u5 target using internal RTC ressources
 *
 * Use RTC Wakeup timer to wakeup application periodicaly from (TBD) ms to (TBD) seconds
 * Use Alarm A and B to wake up application on specifique time (+ weekday[0-6] or date[1-31])
 * Each Alarm is independant and can also be use to wake up application periodically on specific time every
 * 	- seconds
 *  - or minutes
 *  - or hours
 *  - or weekday [0-6]
 *  - or date [1-31]
 * 	=> for that use mask defined in rtc_alarm_mask enum
 */

#define DT_DRV_COMPAT st_stm32_rtc

#include <drivers/rtc.h>
#include <drivers/clock_control/stm32_clock_control.h>
#include <zephyr/types.h>
#include <logging/log.h>

/* DEV_DATA() macro obtains a properly typed pointer to the driver’s dev_data struct */
#define DEV_DATA(dev) ((struct rtc_stm32_data *)(dev)->data)
/* DEV_CFG() macro obtains a properly typed pointer to the driver’s config_info struct */
#define DEV_CFG(dev) ((const struct rtc_stm32_config *const)(dev)->config)

/* stm32 rtc config structure */
struct rtc_stm32_config {
	struct stm32_pclken pclken;
};

/* stm32 rtc data structure */
struct rtc_stm32_data {
	struct rtc_wakeup wut[RTC_WUT_NUM];
	struct rtc_alarm alarm[RTC_ALARM_NUM];
};

/* Select RTC clock source: LSI or LSE*/
/* todo: improve by using Kconfig or dts */
#define RTC_CLOCK_SOURCE_LSI    0
#define RTC_CLOCK_SOURCE_LSE    1
#define RTC_CLOCK_SOURCE                RTC_CLOCK_SOURCE_LSE

#if (RTC_CLOCK_SOURCE == RTC_CLOCK_SOURCE_LSI)
	#define RTC_ASYNCH_PREDIV    0x7FU
	#define RTC_SYNCH_PREDIV     0x00F9U
#elif (RTC_CLOCK_SOURCE == RTC_CLOCK_SOURCE_LSE)
	#define RTC_ASYNCH_PREDIV  0x7FU
	#define RTC_SYNCH_PREDIV   0x00FFU
#endif /* RTC_CLOCK_SOURCE */

/* Enumeration of RTC error handler code */
enum rtc_error_handler {
	RTC_E_ERR_UNKNOWN               = 0U,   /* Unknown error */
	RTC_E_ERR_INIT                  = 1U,   /* Error during HAL_RTC_Init() call */
	RTC_E_ERR_WU_TIMER_SET          = 2U,   /* Error during HAL_RTCEx_SetWakeUpTimer_IT() call */
	RTC_E_ERR_WU_TIMER_START        = 3U,   /* Error during ActivateWakeUpTimer() call */
	RTC_E_ERR_WU_TIMER_STOP         = 4U,   /* Error during HAL_RTCEx_DeactivateWakeUpTimer() call */
	RTC_E_ERR_ALARM_SET             = 5U,
	RTC_E_ERR_ALARM_START           = 6U,
	RTC_E_ERR_ALARM_STOP            = 7U,
	RTC_E_ERR_INIT_OSC              = 8U,   /* Error during HAL_RCC_OscConfig() call during RTC init */
	RTC_E_ERR_INIT_PERIPH_CLK       = 9U,   /* Error during HAL_RCCEx_PeriphCLKConfig() call during RTC init */
	RTC_E_ERR_INIT_SET_TIME         = 10U,  /* Error during time setting */
	RTC_E_ERR_INIT_SET_DATE         = 11U,  /* Error during date setting */
	RTC_E_ERR_INIT_GET_TIME         = 12U,  /* Error during time getting */
	RTC_E_ERR_INIT_GET_DATE         = 12U,  /* Error during date getting */
};

/* Wake up timer autoreload parameter */
#define RTC_STM32_WUT_AUTORELOAD_NB_BITS 16
#define RTC_MAX_AUTORELOAD      ((1 << RTC_STM32_WUT_AUTORELOAD_NB_BITS) - 1)

/* Mapping between a wakeup timer clock configuration symbol and the actual division performed */
static const uint32_t ck_div_to_val[][2] = {
	{ RTC_WAKEUPCLOCK_RTCCLK_DIV2,  2 },
	{ RTC_WAKEUPCLOCK_RTCCLK_DIV4,  4 },
	{ RTC_WAKEUPCLOCK_RTCCLK_DIV8,  8 },
	{ RTC_WAKEUPCLOCK_RTCCLK_DIV16, 16 },
	{ RTC_WAKEUPCLOCK_CK_SPRE_16BITS, 32768 },
};

/*	RTC handler declaration */
RTC_HandleTypeDef rtc_handle;

/* Register module to use logging */
LOG_MODULE_REGISTER(rtc_stm32, CONFIG_RTC_LOG_LEVEL);

static void rtc_stm32_irq_config(const struct device *dev);

// -------------------------------------------------------------------------------------------------------- //
//
//                            Local functions
//
// -------------------------------------------------------------------------------------------------------- //

/**
 * @brief RTC_ErrorHandler function is executed in case of RTC error occurrence
 *
 * @param e_ErrorHandler Error handler
 */
static void RTC_ErrorHandler(enum rtc_error_handler e_ErrorHandler)
{
	(void) e_ErrorHandler;

	/* todo: manage error */
	printk("RTC_ErrorHandler: %i \n", e_ErrorHandler);
}

/**
 * @brief RTC MSP Initialization
 *
 * @param hrtc RTC handler
 */
void HAL_RTC_MspInit(RTC_HandleTypeDef *hrtc)
{
	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_PeriphCLKInitTypeDef PeriphClkInit = { 0 };

	if (hrtc->Instance == RTC) {
		/*
		 * To change the source clock of the RTC feature (LSE, LSI), You have to:
		 * - Enable the power clock using __HAL_RCC_PWR_CLK_ENABLE()
		 * - Enable write access using HAL_PWR_EnableBkUpAccess() function before to
		 * 	configure the RTC clock source (to be done once after reset).
		 * - Reset the Back up Domain using __HAL_RCC_BACKUPRESET_FORCE() and
		 * 	__HAL_RCC_BACKUPRESET_RELEASE().
		 * - Configure the needed RTC clock source
		 */
		__HAL_RCC_PWR_CLK_ENABLE();
		HAL_PWR_EnableBkUpAccess();

		/* Set LSE drive capability configuration */
		__HAL_RCC_LSEDRIVE_CONFIG(RCC_BDCR_LSEDRV_1);

		/*
		 * Reset the whole backup domain, RTC included
		 * __HAL_RCC_BACKUPRESET_FORCE();
		 * __HAL_RCC_BACKUPRESET_RELEASE();
		 */

#if (RTC_CLOCK_SOURCE == RTC_CLOCK_SOURCE_LSE)
		/* Enable LSE oscillator */
		RCC_OscInitStruct.OscillatorType =  RCC_OSCILLATORTYPE_LSE;
		RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
		RCC_OscInitStruct.LSEState = RCC_LSE_ON;
		if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
			RTC_ErrorHandler(RTC_E_ERR_INIT_OSC);
		}

		/* Set kernel clock source for RTC */
		PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC;
		PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
		if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
			RTC_ErrorHandler(RTC_E_ERR_INIT_PERIPH_CLK);
		}
#elif (RTC_CLOCK_SOURCE == RTC_CLOCK_SOURCE_LSI)
		(void) RCC_OscInitStruct;
		RCC_OscInitStruct.OscillatorType =  RCC_OSCILLATORTYPE_LSI;
		RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
		RCC_OscInitStruct.LSIState = RCC_LSI_ON;
		if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
			RTC_ErrorHandler(RTC_E_ERR_INIT_OSC);
		}

