zephyrproject-rtos/zephyr/drivers/rtc/rtc_hal_stm32u5.c
		PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC;
		PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
		if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
			RTC_ErrorHandler(RTC_E_ERR_INIT_PERIPH_CLK);
		}
 #else
 #error Please select the RTC Clock source
 #endif /* RTC_CLOCK_SOURCE */

		/* Enable RTC Clock */
		__HAL_RCC_RTC_ENABLE();
		__HAL_RCC_RTCAPB_CLK_ENABLE();

		/*
		 * for STOP3_MODE || STANDBY_MODE || SHUTDOWN_MODE
		 * Enable WakeUp line functionality for the RTC ALARMA
		 * HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN7_HIGH_3);
		 */

		/*
		 * STOP0_MODE || STOP1_MODE || STOP2_MODE
		 * Enable the Autonomous Mode for the RTC
		 */
		__HAL_RCC_RTCAPB_CLKAM_ENABLE();
	}
}

/**
 * @brief Set wake up timer
 *
 * @param hrtc RTC handler
 * @param WakeUpCounter Wake up timer value
 * @param WakeUpClock Wake up timer source clock
 * @param WakeUpAutoClr Wake up timer auto clear
 *
 * @retval HAL status.
 */
static HAL_StatusTypeDef set_wakeup_timer(RTC_HandleTypeDef *hrtc, uint32_t WakeUpCounter, uint32_t WakeUpClock, uint32_t WakeUpAutoClr)
{
	uint32_t tickstart;

	/* Check the parameters */
	assert_param(IS_RTC_WAKEUP_CLOCK(WakeUpClock));
	assert_param(IS_RTC_WAKEUP_COUNTER(WakeUpCounter));
	/* (0x0000<=WUTOCLR<=WUT) */
	assert_param(WakeUpAutoClr <= WakeUpCounter);

	/* Process Locked */
	__HAL_LOCK(hrtc);

	hrtc->State = HAL_RTC_STATE_BUSY;

	/* Disable the write protection for RTC registers */
	__HAL_RTC_WRITEPROTECTION_DISABLE(hrtc);

	/* Clear WUTE in RTC_CR to disable the wakeup timer */
	CLEAR_BIT(RTC->CR, RTC_CR_WUTE);

	/* Clear flag Wake-Up */
	WRITE_REG(RTC->SCR, RTC_SCR_CWUTF);

	/*
	 * Poll WUTWF until it is set in RTC_ICSR to make sure the access to wakeup autoreload
	 * counter and to WUCKSEL[2:0] bits is allowed. This step must be skipped in
	 * calendar initialization mode.
	 */
	if (READ_BIT(RTC->ICSR, RTC_ICSR_INITF) == 0U) {
		tickstart = HAL_GetTick();
		while (READ_BIT(RTC->ICSR, RTC_ICSR_WUTWF) == 0U) {
			if ((HAL_GetTick() - tickstart) > RTC_TIMEOUT_VALUE) {
				/* Enable the write protection for RTC registers */
				__HAL_RTC_WRITEPROTECTION_ENABLE(hrtc);

				hrtc->State = HAL_RTC_STATE_TIMEOUT;

				/* Process Unlocked */
				__HAL_UNLOCK(hrtc);

				return HAL_TIMEOUT;
			}
		}
	}

	/* Configure the Wakeup Timer counter and auto clear value */
	WRITE_REG(RTC->WUTR, (uint32_t)(WakeUpCounter | (WakeUpAutoClr << RTC_WUTR_WUTOCLR_Pos)));

	/* Configure the clock source */
	MODIFY_REG(RTC->CR, RTC_CR_WUCKSEL, (uint32_t)WakeUpClock);

	/* Configure the Interrupt in the RTC_CR register and Enable the Wakeup Timer */
	/*  SET_BIT(RTC->CR, (RTC_CR_WUTIE | RTC_CR_WUTE)); */

	/* Enable the write protection for RTC registers */
	__HAL_RTC_WRITEPROTECTION_ENABLE(hrtc);

	hrtc->State = HAL_RTC_STATE_READY;

	/* Process Unlocked */
	__HAL_UNLOCK(hrtc);

	return HAL_OK;
}

/**
 * @brief Start wake up timer with interrupt
 *
 * @param hrtc RTC handler
 *
 * @retval HAL status.
 */
static HAL_StatusTypeDef ActivateWakeUpTimer_IT(RTC_HandleTypeDef *hrtc)
{
	/* Process Locked */
	__HAL_LOCK(hrtc);

	hrtc->State = HAL_RTC_STATE_BUSY;

	/* Disable the write protection for RTC registers */
	__HAL_RTC_WRITEPROTECTION_DISABLE(hrtc);

	/* Configure the Interrupt in the RTC_CR register and Enable the Wakeup Timer */
	SET_BIT(RTC->CR, (RTC_CR_WUTIE | RTC_CR_WUTE));

	/* Enable the write protection for RTC registers */
	__HAL_RTC_WRITEPROTECTION_ENABLE(hrtc);

	hrtc->State = HAL_RTC_STATE_READY;

	/* Process Unlocked */
	__HAL_UNLOCK(hrtc);

	return HAL_OK;
}

/**
 * @brief Get stm32 alarm mask from RTC alarm mask using Zephyr APIs
 *
 * @param alarm_mask Alarm mask using Zephyr APIs
 *
 * @retval Stm32 alarm mask.
 */
static uint32_t get_stm32_alarm_mask(enum rtc_alarm_mask alarm_mask)
{
	uint32_t stm32_alarm_mask;

	switch (alarm_mask) {
	case RTC_ALARM_MASK_NONE: stm32_alarm_mask = RTC_ALARMMASK_NONE; break;
	case RTC_ALARM_MASK_DATE_WEEKDAY: stm32_alarm_mask = RTC_ALARMMASK_DATEWEEKDAY; break;
	case RTC_ALARM_MASK_HOURS: stm32_alarm_mask = RTC_ALARMMASK_HOURS; break;
	case RTC_ALARM_MASK_MIN: stm32_alarm_mask = RTC_ALARMMASK_MINUTES; break;
	case RTC_ALARM_MASK_SEC: stm32_alarm_mask = RTC_ALARMMASK_SECONDS; break;
	case RTC_ALARM_MASK_ALL: stm32_alarm_mask = RTC_ALARMMASK_ALL; break;
	default: stm32_alarm_mask = RTC_ALARMMASK_NONE; break;         // *Todo: add unknow mask message */
	}
	return stm32_alarm_mask;
}

/**
 * @brief Get stm32 alarm date or weekday selection using Zephyr APIs
 *
 * @param alarm_date_weekday_sel Alarm date or weekday selection using Zephyr APIs
 *
 * @retval Stm32 date or weekday selection.
 */
static uint32_t get_stm32_alarm_date_wday_sel(enum rtc_alarm_date_weekday alarm_date_weekday_sel)
{
	uint32_t stm32_date_weekday_sel;

	switch (alarm_date_weekday_sel) {
	case RTC_ALARM_DATE_SEL: stm32_date_weekday_sel = RTC_ALARMDATEWEEKDAYSEL_DATE; break;
	case RTC_ALARM_WEEKDAY_SEL: stm32_date_weekday_sel = RTC_ALARMDATEWEEKDAYSEL_WEEKDAY; break;
	default: stm32_date_weekday_sel = RTC_ALARMDATEWEEKDAYSEL_WEEKDAY; break;         /* Todo: add unknow selection message */
	}
	return stm32_date_weekday_sel;
}

/**
 * @brief Get stm32 weekday value using Zephyr APIs
 *
 * @param tm_wday Weekday value using Zephyr APIs
 *
 * @retval Stm32 weekday value.
 */
static uint8_t get_stm32_wday_val(int tm_wday)
{
	uint8_t stm32_weekdayVal;

	/* Todo : check range of tm_wday => from 0 to 6 (Zephyr APIs) */
	if (tm_wday == 0) {
		stm32_weekdayVal = 7;   /* Sunday (STM32 APIs) */
	} else {
		stm32_weekdayVal = (uint8_t)tm_wday;
	}

	return stm32_weekdayVal;
}

/**
 * @brief Get stm32 alarm date or weekday value  using Zephyr APIs
 *
 * @param alarm_date_weekday_sel Alarm date or Weekday value using Zephyr APIs
 *
 * @retval Stm32 alarm date or Weekday value.
 */
static uint8_t GetStm32AlarmDateOrWeekdayVal(struct tm alarm_time, enum rtc_alarm_date_weekday alarm_date_weekday_sel)
{
	uint8_t stm32_date_weekdayVal = 0U;

	switch (alarm_date_weekday_sel) {
	case RTC_ALARM_DATE_SEL:
		// Todo : check range of alarm_time.tm_mday => from 1 to 31
		stm32_date_weekdayVal = alarm_time.tm_mday;
		break;
	case RTC_ALARM_WEEKDAY_SEL:
		stm32_date_weekdayVal = get_stm32_wday_val(alarm_time.tm_wday);
		break;
	default:
		// Todo: add unknow selection message
		break;
	}

