zephyrproject-rtos/zephyr/drivers/rtc/rtc_hal_stm32u5.c
	return stm32_date_weekdayVal;
}

/**
 * @brief  Set the specified RTC Alarm.
 *
 * @param  hrtc RTC handle
 * @param  sAlarm Pointer to Alarm structure
 *          if Binary mode is RTC_BINARY_ONLY, 3 fields only are used
 *             sAlarm->AlarmTime.SubSeconds
 *             sAlarm->AlarmSubSecondMask
 *             sAlarm->BinaryAutoClr
 * @param  Format Specifies the format of the entered parameters.
 *          if Binary mode is RTC_BINARY_ONLY, this parameter is not used
 *          else this parameter can be one of the following values
 *             @arg RTC_FORMAT_BIN: Binary format
 *             @arg RTC_FORMAT_BCD: BCD format
 *
 * @retval HAL status
 */
static HAL_StatusTypeDef set_alarm(RTC_HandleTypeDef *hrtc, RTC_AlarmTypeDef *sAlarm, uint32_t Format)
{
	uint32_t tmpreg = 0, binaryMode;

	/* Process Locked */
	__HAL_LOCK(hrtc);

	hrtc->State = HAL_RTC_STATE_BUSY;

#ifdef  USE_FULL_ASSERT
	/* Check the parameters depending of the Binary mode (32-bit free-running counter configuration). */
	if (READ_BIT(RTC->ICSR, RTC_ICSR_BIN) == RTC_BINARY_NONE) {
		assert_param(IS_RTC_FORMAT(Format));
		assert_param(IS_RTC_ALARM(sAlarm->Alarm));
		assert_param(IS_RTC_ALARM_MASK(sAlarm->AlarmMask));
		assert_param(IS_RTC_ALARM_DATE_WEEKDAY_SEL(sAlarm->AlarmDateWeekDaySel));
		assert_param(IS_RTC_ALARM_SUB_SECOND_VALUE(sAlarm->AlarmTime.SubSeconds));
		assert_param(IS_RTC_ALARM_SUB_SECOND_MASK(sAlarm->AlarmSubSecondMask));
	} else if (READ_BIT(RTC->ICSR, RTC_ICSR_BIN) == RTC_BINARY_ONLY) {
		assert_param(IS_RTC_ALARM_SUB_SECOND_BINARY_MASK(sAlarm->AlarmSubSecondMask));
		assert_param(IS_RTC_ALARMSUBSECONDBIN_AUTOCLR(sAlarm->BinaryAutoClr));
	} else {  /* RTC_BINARY_MIX */
		assert_param(IS_RTC_FORMAT(Format));
		assert_param(IS_RTC_ALARM(sAlarm->Alarm));
		assert_param(IS_RTC_ALARM_MASK(sAlarm->AlarmMask));
		assert_param(IS_RTC_ALARM_DATE_WEEKDAY_SEL(sAlarm->AlarmDateWeekDaySel));
		/* In Binary Mix Mode, the RTC can not generate an alarm on a match
		   involving all calendar items + the upper SSR bits */
		assert_param((sAlarm->AlarmSubSecondMask >> RTC_ALRMASSR_MASKSS_Pos) <= (8U + (READ_BIT(RTC->ICSR, RTC_ICSR_BCDU) >> RTC_ICSR_BCDU_Pos)));
	}
#endif /* USE_FULL_ASSERT */

	/* Get Binary mode (32-bit free-running counter configuration) */
	binaryMode = READ_BIT(RTC->ICSR, RTC_ICSR_BIN);

	if (binaryMode != RTC_BINARY_ONLY) {
		if (Format == RTC_FORMAT_BIN) {
			if (READ_BIT(RTC->CR, RTC_CR_FMT) != 0U) {
				assert_param(IS_RTC_HOUR12(sAlarm->AlarmTime.Hours));
				assert_param(IS_RTC_HOURFORMAT12(sAlarm->AlarmTime.TimeFormat));
			} else {
				sAlarm->AlarmTime.TimeFormat = 0x00U;
				assert_param(IS_RTC_HOUR24(sAlarm->AlarmTime.Hours));
			}
			assert_param(IS_RTC_MINUTES(sAlarm->AlarmTime.Minutes));
			assert_param(IS_RTC_SECONDS(sAlarm->AlarmTime.Seconds));

			if (sAlarm->AlarmDateWeekDaySel == RTC_ALARMDATEWEEKDAYSEL_DATE) {
				assert_param(IS_RTC_ALARM_DATE_WEEKDAY_DATE(sAlarm->AlarmDateWeekDay));
			} else {
				assert_param(IS_RTC_ALARM_DATE_WEEKDAY_WEEKDAY(sAlarm->AlarmDateWeekDay));
			}
			tmpreg = (((uint32_t)RTC_ByteToBcd2(sAlarm->AlarmTime.Hours) << RTC_ALRMAR_HU_Pos) |	\
				  ((uint32_t)RTC_ByteToBcd2(sAlarm->AlarmTime.Minutes) << RTC_ALRMAR_MNU_Pos) |	\
				  ((uint32_t)RTC_ByteToBcd2(sAlarm->AlarmTime.Seconds) << RTC_ALRMAR_SU_Pos) |	\
				  ((uint32_t)(sAlarm->AlarmTime.TimeFormat) << RTC_ALRMAR_PM_Pos) |		\
				  ((uint32_t)RTC_ByteToBcd2(sAlarm->AlarmDateWeekDay) << RTC_ALRMAR_DU_Pos) |	\
				  ((uint32_t)sAlarm->AlarmDateWeekDaySel) |					\
				  ((uint32_t)sAlarm->AlarmMask));
		} else {  /* Format BCD */
			if (READ_BIT(RTC->CR, RTC_CR_FMT) != 0U) {
				assert_param(IS_RTC_HOUR12(RTC_Bcd2ToByte(sAlarm->AlarmTime.Hours)));
				assert_param(IS_RTC_HOURFORMAT12(sAlarm->AlarmTime.TimeFormat));
			} else {
				sAlarm->AlarmTime.TimeFormat = 0x00U;
				assert_param(IS_RTC_HOUR24(RTC_Bcd2ToByte(sAlarm->AlarmTime.Hours)));
			}

			assert_param(IS_RTC_MINUTES(RTC_Bcd2ToByte(sAlarm->AlarmTime.Minutes)));
			assert_param(IS_RTC_SECONDS(RTC_Bcd2ToByte(sAlarm->AlarmTime.Seconds)));

#ifdef  USE_FULL_ASSERT
			if (sAlarm->AlarmDateWeekDaySel == RTC_ALARMDATEWEEKDAYSEL_DATE) {
				assert_param(IS_RTC_ALARM_DATE_WEEKDAY_DATE(RTC_Bcd2ToByte(sAlarm->AlarmDateWeekDay)));
			} else {
				assert_param(IS_RTC_ALARM_DATE_WEEKDAY_WEEKDAY(RTC_Bcd2ToByte(sAlarm->AlarmDateWeekDay)));
			}

#endif /* USE_FULL_ASSERT */
			tmpreg = (((uint32_t)(sAlarm->AlarmTime.Hours) << RTC_ALRMAR_HU_Pos) |	    \
				  ((uint32_t)(sAlarm->AlarmTime.Minutes) << RTC_ALRMAR_MNU_Pos) |   \
				  ((uint32_t)(sAlarm->AlarmTime.Seconds) << RTC_ALRMAR_SU_Pos) |    \
				  ((uint32_t)(sAlarm->AlarmTime.TimeFormat) << RTC_ALRMAR_PM_Pos) | \
				  ((uint32_t)(sAlarm->AlarmDateWeekDay) << RTC_ALRMAR_DU_Pos) |	    \
				  ((uint32_t)sAlarm->AlarmDateWeekDaySel) |			    \
				  ((uint32_t)sAlarm->AlarmMask));

		}
	}

	/* Disable the write protection for RTC registers */
	__HAL_RTC_WRITEPROTECTION_DISABLE(hrtc);

	/* Configure the Alarm registers */
	if (sAlarm->Alarm == RTC_ALARM_A) {
		/* Disable the Alarm A interrupt */
		CLEAR_BIT(RTC->CR, RTC_CR_ALRAE | RTC_CR_ALRAIE);
		/* Clear flag alarm A */
		WRITE_REG(RTC->SCR, RTC_SCR_CALRAF);

		if (binaryMode == RTC_BINARY_ONLY) {
			RTC->ALRMASSR = sAlarm->AlarmSubSecondMask | sAlarm->BinaryAutoClr;
		} else {
			WRITE_REG(RTC->ALRMAR, tmpreg);
			WRITE_REG(RTC->ALRMASSR, sAlarm->AlarmSubSecondMask);
		}

		WRITE_REG(RTC->ALRABINR, sAlarm->AlarmTime.SubSeconds);

		if (sAlarm->FlagAutoClr == ALARM_FLAG_AUTOCLR_ENABLE) {
			/* Configure the  Alarm A output clear */
			SET_BIT(RTC->CR, RTC_CR_ALRAOCLR);
		} else {
			/* Disable the  Alarm A output clear*/
			CLEAR_BIT(RTC->CR, RTC_CR_ALRAOCLR);
		}

		/* Configure the Alarm interrupt */
		/*  SET_BIT(RTC->CR, RTC_CR_ALRAE | RTC_CR_ALRAIE); */
	} else {
		/* Disable the Alarm B interrupt */
		CLEAR_BIT(RTC->CR, RTC_CR_ALRBE | RTC_CR_ALRBIE);
		/* Clear flag alarm B */
		WRITE_REG(RTC->SCR, RTC_SCR_CALRBF);

		if (binaryMode == RTC_BINARY_ONLY) {
			WRITE_REG(RTC->ALRMBSSR, sAlarm->AlarmSubSecondMask | sAlarm->BinaryAutoClr);
		} else {
			WRITE_REG(RTC->ALRMBR, tmpreg);
			WRITE_REG(RTC->ALRMBSSR, sAlarm->AlarmSubSecondMask);
		}

		WRITE_REG(RTC->ALRBBINR, sAlarm->AlarmTime.SubSeconds);

