zephyrproject-rtos/zephyr/drivers/rtc/rtc_hal_stm32u5.c
		if (sAlarm->FlagAutoClr == ALARM_FLAG_AUTOCLR_ENABLE) {
			/* Configure the  Alarm B Output clear */
			SET_BIT(RTC->CR, RTC_CR_ALRBOCLR);
		} else {
			/* Disable the  Alarm B Output clear */
			CLEAR_BIT(RTC->CR, RTC_CR_ALRBOCLR);
		}

		/* Configure the Alarm interrupt */
		/* SET_BIT(RTC->CR, RTC_CR_ALRBE | RTC_CR_ALRBIE); */
	}

	/* Enable the write protection for RTC registers */
	__HAL_RTC_WRITEPROTECTION_ENABLE(hrtc);

	hrtc->State = HAL_RTC_STATE_READY;

	/* Process Unlocked */
	__HAL_UNLOCK(hrtc);

	return HAL_OK;
}

/**
 * @brief Start Alarm A or B with interrupt
 *
 * @param hrtc: RTC handle pointer
 * @param stm32_alarm_id: Alarm id (Stm32 format)
 *
 * @retval HAL status
 */
static HAL_StatusTypeDef activate_alarm_it(RTC_HandleTypeDef *hrtc, uint32_t stm32_alarm_id)
{
	assert_param(IS_RTC_ALARM(stm32_alarm_id));

	/* Process Locked */
	__HAL_LOCK(hrtc);

	hrtc->State = HAL_RTC_STATE_BUSY;

	/* Disable the write protection for RTC registers */
	__HAL_RTC_WRITEPROTECTION_DISABLE(hrtc);

	/* Configure the Alarm interrupt */
	if (stm32_alarm_id == RTC_ALARM_A) {
		SET_BIT(RTC->CR, RTC_CR_ALRAE | RTC_CR_ALRAIE);
	} else {   /* RTC_ALARM_B */
		SET_BIT(RTC->CR, RTC_CR_ALRBE | RTC_CR_ALRBIE);
	}

	/* Enable the write protection for RTC registers */
	__HAL_RTC_WRITEPROTECTION_ENABLE(hrtc);

	hrtc->State = HAL_RTC_STATE_READY;

	/* Process Unlocked */
	__HAL_UNLOCK(hrtc);

	return HAL_OK;
}

/**
 * @brief Identify Wake up timer set-up parameters
 *
 * According wut period in milliseconds, identify RTC divider and autoreload values
 *
 * @param period_ms: Wake up timer period in milliseconds
 * @param clk_source_freq: RTC clock source frequency (32768Hz...)
 * @param clk_divider: Pointer to calculated RTC clock divider
 * @param autoreload: Pointer to calculated RTC autoreload value
 *
 * @retval 0		On success.
 * @retval -EINVAL	If setup is invalid.
 */
static int identify_wut_parameters(uint32_t period_ms, uint32_t clk_source_freq,
				   uint32_t *clk_divider, uint32_t *autoreload)
{
	int i, ret = 0;
	uint32_t divider = 0U;
	uint64_t max_period_ms = 0U;
	bool setup_found = false;

	/* Start with lowest division for maximum resolution */
	for (i = 0, setup_found = false; i < ARRAY_SIZE(ck_div_to_val) && !setup_found; i++) {
		divider = ck_div_to_val[i][1];
		max_period_ms = divider * RTC_MAX_AUTORELOAD * 1000 / clk_source_freq;

		if (max_period_ms >= period_ms) {
			*clk_divider = ck_div_to_val[i][0];
			*autoreload = period_ms * clk_source_freq / divider / 1000 - 1;
			setup_found = true;
		}
	}

	if (!setup_found) {
		ret = -EINVAL;
	}

	return ret;
}

// -------------------------------------------------------------------------------------------------------- //
//
//                            ZEPHYR APIs for RTC driver
//
// -------------------------------------------------------------------------------------------------------- //

static int rtc_stm32_set_current_time(const struct device *dev, const struct tm date_time)
{
	RTC_TimeTypeDef sTime = { 0 };
	RTC_DateTypeDef sDate = { 0 };
	uint32_t Format = RTC_FORMAT_BIN;       /* versus RTC_FORMAT_BCD */

	/* Check date_time limits */
	/* todo: return -EINVAL if date or time settings are invalid */

	/* Set the Time */
	sTime.Hours = (uint8_t)date_time.tm_hour;
	sTime.Minutes = (uint8_t)date_time.tm_min;
	sTime.Seconds = (uint8_t)date_time.tm_sec;
	sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
	sTime.StoreOperation = RTC_STOREOPERATION_RESET;
	if (HAL_RTC_SetTime(&rtc_handle, &sTime, Format) != HAL_OK) {
		RTC_ErrorHandler(RTC_E_ERR_INIT_SET_TIME);
		return -ENOTSUP;
	}
	/* Set the Date */
	sDate.WeekDay = get_stm32_wday_val(date_time.tm_wday);
	sDate.Year = (uint8_t)date_time.tm_year;
	sDate.Month = (uint8_t)date_time.tm_mon;
	sDate.Date = (uint8_t)date_time.tm_mday;

	if (HAL_RTC_SetDate(&rtc_handle, &sDate, Format) != HAL_OK) {
		RTC_ErrorHandler(RTC_E_ERR_INIT_SET_DATE);
		return -ENOTSUP;
	}

	return 0;
}

static int rtc_stm32_get_current_time(const struct device *dev, struct tm *date_time)
{
	RTC_DateTypeDef date = { 0 };
	RTC_TimeTypeDef time = { 0 };
	uint32_t Format = RTC_FORMAT_BIN;       /* versus RTC_FORMAT_BCD */

	/* Get the RTC current Time */
	if (HAL_RTC_GetTime(&rtc_handle, &time, Format) != HAL_OK) {
		RTC_ErrorHandler(RTC_E_ERR_INIT_GET_TIME);
		return -ENOTSUP;
	}
	/* Get the RTC current Date */
	if (HAL_RTC_GetDate(&rtc_handle, &date, Format) != HAL_OK) {
		RTC_ErrorHandler(RTC_E_ERR_INIT_GET_DATE);
		return -ENOTSUP;
	}

	date_time->tm_year = (int)date.Year;
	date_time->tm_mon = (int)date.Month;
	date_time->tm_mday = (int)date.Date;
	date_time->tm_wday = (int)date.WeekDay;

	date_time->tm_hour = (int)time.Hours;
	date_time->tm_min = (int)time.Minutes;
	date_time->tm_sec = (int)time.Seconds;

	return 0;
}

static int rtc_stm32_set_wakeup_timer(const struct device *dev, struct rtc_wakeup wut, enum rtc_wakeup_id wut_id)
{
	struct rtc_stm32_data *data = DEV_DATA(dev);
	uint32_t wut_autoreload = 0U;           /* Wake up timer autoreload value */
	uint32_t wut_source_clock = 0U;         /* Wake up timer source clock */
	uint32_t wut_auto_clear = 0U;           /* Wake up timer auto clear value */

	/* Check wake up timer id: only 1 rtc wake up timer for stm32u5 */
	if (wut_id == RTC_WUT0) {
		/* Calculated wut parameters */
		if (0 == identify_wut_parameters(wut.period, 32768U, &wut_source_clock, &wut_autoreload)) {
			data->wut[wut_id].period = wut.period;
			data->wut[wut_id].callback = wut.callback;
			wut_auto_clear = 0U;
		} else {
			return -EINVAL;
		}

		if (set_wakeup_timer(&rtc_handle, wut_autoreload, wut_source_clock, wut_auto_clear) != HAL_OK) {
			RTC_ErrorHandler(RTC_E_ERR_WU_TIMER_SET);
			return -ENOTSUP;
		}
	} else {
		return -EINVAL;
	}

	return 0;
}

static int rtc_stm32_start_wakeup_timer(const struct device *dev, enum rtc_wakeup_id wut_id)
{
	/* Check wake up timer id: only 1 rtc wake up timer for stm32u5 */
	if (wut_id == RTC_WUT0) {
		if (ActivateWakeUpTimer_IT(&rtc_handle) != HAL_OK) {
			RTC_ErrorHandler(RTC_E_ERR_WU_TIMER_START);
			return -ENOTSUP;
		}
	} else {
		return -EINVAL;
	}

