zephyrproject-rtos/zephyr/drivers/rtc/rtc_hal_stm32u5.c
	return 0;
}

static int rtc_stm32_stop_wakeup_timer(const struct device *dev, enum rtc_wakeup_id wut_id)
{
	/* Check wake up timer id: only 1 rtc wake up timer for stm32u5 */
	if (wut_id == RTC_WUT0) {
		if (HAL_RTCEx_DeactivateWakeUpTimer(&rtc_handle) != HAL_OK) {
			RTC_ErrorHandler(RTC_E_ERR_WU_TIMER_STOP);
			return -ENOTSUP;
		}
	} else {
		return -EINVAL;
	}

	return 0;
}

static int rtc_stm32_set_alarm(const struct device *dev, struct rtc_alarm alarm, enum rtc_alarm_id alarm_id)
{
	struct rtc_stm32_data *data = DEV_DATA(dev);
	RTC_AlarmTypeDef sAlarm = { 0 };
	uint32_t Format = RTC_FORMAT_BIN;               /* versus RTC_FORMAT_BCD */

	/* Check alarm id */
	if (alarm_id == RTC_ALARMA) {
		sAlarm.Alarm = RTC_ALARM_A;
	} else if (alarm_id == RTC_ALARMB) {
		sAlarm.Alarm = RTC_ALARM_B;
	} else {
		return -EINVAL;
	}

	/* Record alarm to the rtc data */
	data->alarm[alarm_id].alarm_time.tm_year = alarm.alarm_time.tm_year;    /* Year since 1900 */
	data->alarm[alarm_id].alarm_time.tm_mon = alarm.alarm_time.tm_mon;      /* month of year [0,11], where 0 = jan */
	data->alarm[alarm_id].alarm_time.tm_mday = alarm.alarm_time.tm_mday;    /* Day of month [1,31] */
	data->alarm[alarm_id].alarm_time.tm_hour = alarm.alarm_time.tm_hour;    /* Hour [0,23] */
	data->alarm[alarm_id].alarm_time.tm_min = alarm.alarm_time.tm_min;      /* Minutes [0,59] */
	data->alarm[alarm_id].alarm_time.tm_sec = alarm.alarm_time.tm_sec;      /* Seconds [0,61] */
	data->alarm[alarm_id].alarm_time.tm_isdst = alarm.alarm_time.tm_isdst;  /* Daylight savings flag: Is DST on? 1 = yes, 0 = no, -1 = unknown */
	data->alarm[alarm_id].alarm_time.tm_wday = alarm.alarm_time.tm_wday;    /* Day of week [0,6] (Sunday = 0) */
	data->alarm[alarm_id].alarm_time.tm_yday = alarm.alarm_time.tm_yday;    /* Day of year [0,365] */
	data->alarm[alarm_id].alarm_date_weekday_sel = alarm.alarm_date_weekday_sel;
	data->alarm[alarm_id].alarm_mask = alarm.alarm_mask;
	data->alarm[alarm_id].callback = alarm.callback;

	/* Prepare alarm to the stm32 format */
	sAlarm.AlarmTime.Hours = (uint8_t)alarm.alarm_time.tm_hour;
	sAlarm.AlarmTime.Minutes = (uint8_t)alarm.alarm_time.tm_min;
	sAlarm.AlarmTime.Seconds = (uint8_t)alarm.alarm_time.tm_sec;
	sAlarm.AlarmTime.SubSeconds = 0U;
	sAlarm.AlarmMask = get_stm32_alarm_mask(alarm.alarm_mask);
	sAlarm.AlarmSubSecondMask = RTC_ALARMSUBSECONDMASK_ALL;
	sAlarm.AlarmDateWeekDaySel = get_stm32_alarm_date_wday_sel(alarm.alarm_date_weekday_sel);
	sAlarm.AlarmDateWeekDay =  GetStm32AlarmDateOrWeekdayVal(alarm.alarm_time, alarm.alarm_date_weekday_sel);

	if (set_alarm(&rtc_handle, &sAlarm, Format) != HAL_OK) {
		RTC_ErrorHandler(RTC_E_ERR_ALARM_SET);
		return -ENOTSUP;
	}

	return 0;
}

static int rtc_stm32_start_alarm(const struct device *dev, enum rtc_alarm_id alarm_id)
{
	uint32_t stm32_alarm_id = 0;

	/* Check alarm id */
	if (alarm_id == RTC_ALARMA) {
		stm32_alarm_id = RTC_ALARM_A;

	} else if (alarm_id == RTC_ALARMB) {
		stm32_alarm_id = RTC_ALARM_B;
	} else {
		return -EINVAL;
	}

	if (activate_alarm_it(&rtc_handle, stm32_alarm_id) != HAL_OK) {
		RTC_ErrorHandler(RTC_E_ERR_ALARM_START);
		return -ENOTSUP;
	}

	return 0;
}

static int rtc_stm32_stop_alarm(const struct device *dev, enum rtc_alarm_id alarm_id)
{
	uint32_t stm32_alarm_id = 0;

	/** Check alarm id */
	if (alarm_id == RTC_ALARMA) {
		stm32_alarm_id = RTC_ALARM_A;
	} else if (alarm_id == RTC_ALARMB) {
		stm32_alarm_id = RTC_ALARM_B;
	} else {
		return -EINVAL;
	}

	if (HAL_RTC_DeactivateAlarm(&rtc_handle, stm32_alarm_id) != HAL_OK) {
		RTC_ErrorHandler(RTC_E_ERR_ALARM_STOP);
		return -ENOTSUP;
	}

	return 0;
}

/**
 * @brief rtc interrupt
 * @param dev Pointeur to the device instance
 */
void rtc_stm32_isr(const struct device *dev)
{
	struct rtc_stm32_data *data = DEV_DATA(dev);
	uint32_t misr_reg = READ_REG(RTC->MISR);

	/* Get the pending status of the WAKEUPTIMER Interrupt */
	if (READ_BIT(RTC->MISR, RTC_MISR_WUTMF) != 0U) {
		/* Clear the WAKEUPTIMER interrupt pending bit */
		WRITE_REG(RTC->SCR, RTC_SCR_CWUTF);

		/* WAKEUPTIMER callback */
		data->wut[RTC_WUT0].callback(dev);
	}
	/* Get the pending status of the AlarmA Interrupt */
	else if ((misr_reg & RTC_MISR_ALRAMF) != 0U) {
		/* Clear the AlarmA interrupt pending bit */
		WRITE_REG(RTC->SCR, RTC_SCR_CALRAF);

		/* AlarmA callback */
		data->alarm[RTC_ALARMA].callback(dev);
	}
	/* Get the pending status of the AlarmB Interrupt */
	else if ((misr_reg & RTC_MISR_ALRBMF) != 0U) {
		/* Clear the AlarmA interrupt pending bit */
		WRITE_REG(RTC->SCR, RTC_SCR_CALRBF);

		/* AlarmB callback */
		data->alarm[RTC_ALARMB].callback(dev);
	}

	/* Change RTC state */
	rtc_handle.State = HAL_RTC_STATE_READY;
}

/**
 * @brief Init specified rtc device
 * @param dev Pointeur to the device instance
 * @retval 0 if successful
 */
static int rtc_stm32_init(const struct device *dev)
{
	int ret = 0;

	const struct device *clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	const struct rtc_stm32_config *cfg = DEV_CFG(dev);

	if (clock_control_on(clk, (clock_control_subsys_t *) &cfg->pclken) != 0) {
		LOG_ERR("clock op failed\n");
		return -EIO;
	}

	HAL_Init();

	/* Set RTC Instance */
	rtc_handle.Instance = RTC;

	/* Set parameter to be configured */
	rtc_handle.Init.HourFormat = RTC_HOURFORMAT_24;
	rtc_handle.Init.AsynchPrediv = RTC_ASYNCH_PREDIV;
	rtc_handle.Init.SynchPrediv = RTC_SYNCH_PREDIV;
	rtc_handle.Init.OutPut = RTC_OUTPUT_DISABLE; /* versus RTC_OUTPUT_WAKEUP; */
	rtc_handle.Init.OutPutRemap = RTC_OUTPUT_REMAP_NONE;
	rtc_handle.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
	rtc_handle.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN; /* versus RTC_OUTPUT_TYPE_PUSHPULL */
	rtc_handle.Init.OutPutPullUp = RTC_OUTPUT_PULLUP_NONE;  /* versus RTC_OUTPUT_PULLUP_ON */

	/* Initialize the RTC peripher */
	if (HAL_RTC_Init(&rtc_handle) != HAL_OK) {
		RTC_ErrorHandler(RTC_E_ERR_INIT);
	}

	rtc_stm32_irq_config(dev);

	return ret;
}

// -------------------------------------------------------------------------------------------------------- //
// Device driver conveniences
// -------------------------------------------------------------------------------------------------------- //
static const struct rtc_driver_api rtc_stm32_driver_api = {
	.set_time = rtc_stm32_set_current_time,
	.get_time = rtc_stm32_get_current_time,
	.set_wakeup_timer = rtc_stm32_set_wakeup_timer,
	.start_wakeup_timer = rtc_stm32_start_wakeup_timer,
	.stop_wakeup_timer = rtc_stm32_stop_wakeup_timer,
	.set_alarm = rtc_stm32_set_alarm,
	.start_alarm = rtc_stm32_start_alarm,
	.stop_alarm = rtc_stm32_stop_alarm,
};

static struct rtc_stm32_data rtc_data;

static const struct rtc_stm32_config rtc_config = {
	.pclken = {
		.enr = DT_INST_CLOCKS_CELL(0, bits),
		.bus = DT_INST_CLOCKS_CELL(0, bus),
	},
};

DEVICE_DT_INST_DEFINE(0, &rtc_stm32_init, NULL,
		      &rtc_data, &rtc_config, PRE_KERNEL_1,
		      CONFIG_KERNEL_INIT_PRIORITY_DEVICE, &rtc_stm32_driver_api);


static void rtc_stm32_irq_config(const struct device *dev)
{
	IRQ_CONNECT(DT_INST_IRQN(0),
		    DT_INST_IRQ(0, priority),
		    rtc_stm32_isr, DEVICE_DT_INST_GET(0), 0);
	irq_enable(DT_INST_IRQN(0));
}
